export enum Department {
  KOR = '국어국문학과',
  ENG = '영어영문학과',
  HIS = '사학과',
  PHI = '철학과',
  FRN = '불어불문학과',
  GER = '독어독문학과',
  CHN = '중어중문학과',
  ANT = '고고인류학과',
  JPN = '일어일문학과',
  CLA = '한문학과',
  RUS = '노어노문학과',
  HUM = '인문대학 자율학부',
  POL = '정치외교학과',
  SOC = '사회학과',
  GEO = '지리학과',
  LIS = '문헌정보학과',
  PSY = '심리학과',
  SWK = '사회복지학부',
  MED = '미디어커뮤니케이션학과',
  SOS = '사회과학대학 자율학부',
  MAT = '수학과',
  PHY = '물리학과',
  CHM = '화학과',
  BIO = '생물학과',
  BTC = '생명공학부',
  STA = '통계학과',
  GOLASTOCN = '지구시스템과학부', // 지구시스템과학부
  // GOL = '지질학전공', // 지구시스템과학부 지질학전공
  // AST = '천문대기과학전공', // 지구시스템과학부 천문대기과학전공
  // OCN = '해양학전공', // 지구시스템과학부 해양학전공
  NAS = '자연과학대학 자율학부',
  ECO = '경제통상학부',
  BIZ = '경영학부',
  EBA = '경상대학 자율학부',
  MSE = '금속재료공학과',
  NSE = '신소재공학과',
  MEH = '기계공학부',
  ARC = '건축학부',
  CIV = '토목공학과',
  ACH = '응용화학과',
  CHE = '화학공학과',
  PLM = '고분자공학과',
  TEX = '섬유시스템공학과',
  ENV = '환경공학과',
  ENE = '에너지공학부',
  AEE = '공과대학 자율학부',
  SEE = '전자공학부',
  EMB = '전자공학부 모바일공학전공', // IT대학 전자공학부 모바일공학전공
  AI = '전자공학부 인공지능전공', // IT대학 전자공학부 인공지능전공
  CSE = '컴퓨터학부',
  ELE = '전기공학과',
  ITE = 'IT대학 자율학부',
  AIE = 'IT 첨단자율학부',
  ABS = '응용생명과학부',
  // PBS = '식물생명과학전공', // 농업생명과학대학 응용생명과학부 식물생명과학전공
  // KAC = '환경생명화학전공', // 농업생명과학대학 응용생명과학부 환경생명화학전공
  PMD = '식물의학과',
  FBT = '식품공학부',
  FORWDELAR = '산림과학·조경학부', // 농업생명과학대학 산림과학·조경학부
  // FOR = '임학전공', // 농업생명과학대학 산림과학·조경학부 임학전공
  // WDE = '임산공학전공', // 농업생명과학대학 산림과학·조경학부 임산공학전공
  // LAR = '조경학전공', // 농업생명과학대학 산림과학·조경학부 조경학전공
  HOR = '원예과학과',
  BFS = '바이오섬유소재학과',
  AGM = '농업토목공학과',
  SBG = '스마트생물산업기계공학과',
  FRE = '식품자원경제학과',
  AIF = '농산업학과',
  CAL = '농업생명과학대학 자율학부',
  MUS = '음악학과',
  KMU = '국악학과',
  ART = '미술학과',
  VCD = '디자인학과',
  EDU = '교육학과',
  KED = '국어교육과',
  EED = '영어교육과',
  DEGFEG = '유럽어교육학부', // 사범대학 유럽어교육학부
  // DEG = '독어교육전공', // 사범대학 유럽어교육학부 독어교육전공
  // FEG = '불어교육전공', // 사범대학 유럽어교육학부 불어교육전공
  HED = '역사교육과',
  GRED = '지리교육과',
  SSED = '일반사회교육과',
  ETH = '윤리교육과',
  MEDU = '수학교육과',
  PHED = '물리교육과',
  CHED = '화학교육과',
  BIED = '생물교육과',
  ESED = '지구과학교육과',
  HMED = '가정교육과',
  SPED = '체육교육과',
  ICED = '정보·컴퓨터교육과',
  MEX = '의과대학',
  DEN = '치과대학',
  VET = '수의과대학',
  CHD = '아동학부',
  FAS = '의류학과',
  NUT = '식품영양학과',
  NUR = '간호학과',
  PHA = '약학과',
  CON = '융합학부',
  MOB = '스마트모빌리티공학과',
  AER = '우주공학부',
  DRG = '혁신신약학과',
  BST = '의생명융합공학과',
  ROB = '로봇공학과',
  PAD = '행정학부',
  UDM = '자율전공학부',
  ADV_AEE = '공학 첨단자율학부',
  OTHERS = '기타',
}

/**
 * {
  "인문대학": {
    "국어국문학과": "KOR",
    "영어영문학과": "ENG",
    "사학과": "HIS",
    "철학과": "PHI",
    "불어불문학과": "FRN",
    "독어독문학과": "GER",
    "중어중문학과": "CHN",
    "고고인류학과": "ANT",
    "일어일문학과": "JPN",
    "한문학과": "CLA",
    "노어노문학과": "RUS",
    "인문대학 자율학부": "HUM"
  },
  "사회과학대학": {
    "정치외교학과": "POL",
    "사회학과": "SOC",
    "지리학과": "GEO",
    "문헌정보학과": "LIS",
    "심리학과": "PSY",
    "사회복지학부": "SWK",
    "미디어커뮤니케이션학과": "MED",
    "사회과학대학 자율학부": "SOS"
  },
  "자연과학대학": {
    "수학과": "MAT",
    "물리학과": "PHY",
    "화학과": "CHM",
    "생물학과": "BIO",
    "생명공학부": "BTC",
    "통계학과": "STA",
    "지구시스템과학부": {
      "지질학전공": "GOL",
      "천문대기과학전공": "AST",
      "해양학전공": "OCN"
    },
    "자연과학대학 자율학부": "NAS"
  },
  "경상대학": {
    "경제통상학부": "ECO",
    "경영학부": "BIZ",
    "경상대학 자율학부": "EBA"
  },
  "공과대학": {
    "금속재료공학과": "MSE",
    "신소재공학과": "NSE",
    "기계공학부": "MEH",
    "건축학부": "ARC",
    "토목공학과": "CIV",
    "응용화학과": "ACH",
    "화학공학과": "CHE",
    "고분자공학과": "PLM",
    "섬유시스템공학과": "TEX",
    "환경공학과": "ENV",
    "에너지공학부": "ENE",
    "공과대학 자율학부": "AEE"
  },
  "IT대학": {
    "전자공학부": "SEE",
    "전자공학부 모바일공학전공": "EMB",
    "컴퓨터학부": "CSE",
    "전기공학과": "ELE",
    "IT대학 자율학부": "ITE",
    "IT 첨단자율학부": "AIE"
  },
  "농업생명과학대학": {
    "응용생명과학부": "ABS",
    "식물생명과학전공": "PBS",
    "환경생명화학전공": "KAC",
    "식물의학과": "PMD",
    "식품공학부": "FBT",
    "산림과학·조경학부": {
      "임학전공": "FOR",
      "임산공학전공": "WDE",
      "조경학전공": "LAR"
    },
    "원예과학과": "HOR",
    "바이오섬유소재학과": "BFS",
    "농업토목공학과": "AGM",
    "스마트생물산업기계공학과": "SBG",
    "식품자원경제학과": "FRE",
    "농산업학과": "AIF",
    "농업생명과학대학 자율학부": "CAL"
  },
  "예술대학": {
    "음악학과": "MUS",
    "국악학과": "KMU",
    "미술학과": "ART",
    "디자인학과": "VCD"
  },
  "사범대학": {
    "교육학과": "EDU",
    "국어교육과": "KED",
    "영어교육과": "EED",
    "유럽어교육학부": {
      "독어교육전공": "DEG",
      "불어교육전공": "FEG"
    },
    "역사교육과": "HED",
    "지리교육과": "GRED",
    "일반사회교육과": "SSED",
    "윤리교육과": "ETH",
    "수학교육과": "MEDU",
    "물리교육과": "PHED",
    "화학교육과": "CHED",
    "생물교육과": "BIED",
    "지구과학교육과": "ESED",
    "가정교육과": "HMED",
    "체육교육과": "SPED",
    "정보·컴퓨터교육과": "ICED"
  },
  "의과대학": "MEX",
  "치과대학": "DEN",
  "수의과대학": "VET",
  "생활과학대학": {
    "아동학부": "CHD",
    "의류학과": "FAS",
    "식품영양학과": "NUT"
  },
  "간호대학": {
    "간호학과": "NUR"
  },
  "약학대학": {
    "약학과": "PHA"
  },
  "첨단기술융합대학": {
    "융합학부": "CON",
    "수소및신재생에너지전공": "HNR",
    "스마트모빌리티공학과": "MOB",
    "우주공학부": "AER",
    "혁신신약학과": "DRG",
    "의생명융합공학과": "BST",
    "로봇공학과": "ROB"
  },

  "행정학부": {
    "행정학부": "PAD"
  },
  "자율전공학부": {
    "자율전공학부": "UDM"
  },
  "공과대학/농업생명과학대학": {
    "공학 첨단자율학부": "AEE"
  }
}

 */
